eledog2024/2026-h-/empty.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.05.01.00"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.05.01.00"
 * @versions {"tool":"1.24.0+4110"}
 */

/**
 * Import the modules used in this configuration.
 */
const GPIO   = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1  = GPIO.addInstance();
const GPIO2  = GPIO.addInstance();
const GPIO3  = GPIO.addInstance();
const GPIO4  = GPIO.addInstance();
const GPIO5  = GPIO.addInstance();
const GPIO6  = GPIO.addInstance();
const GPIO7  = GPIO.addInstance();
const GPIO8  = GPIO.addInstance();
const PWM    = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1   = PWM.addInstance();
const PWM2   = PWM.addInstance();
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");
const UART   = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1  = UART.addInstance();
const UART2  = UART.addInstance();
const UART3  = UART.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
GPIO1.$name                                       = "GPIO_MOTOR";
GPIO1.associatedPins.create(5);
GPIO1.associatedPins[0].$name                     = "PIN_ML1";
GPIO1.associatedPins[1].$name                     = "PIN_ML2";
GPIO1.associatedPins[1].pin.$assign               = "PB15";
GPIO1.associatedPins[2].$name                     = "PIN_MR1";
GPIO1.associatedPins[2].pin.$assign               = "PB16";
GPIO1.associatedPins[3].$name                     = "PIN_MR2";
GPIO1.associatedPins[3].pin.$assign               = "PB0";
GPIO1.associatedPins[4].$name                     = "PIN_STBY";
GPIO1.associatedPins[4].pin.$assignAllowConflicts = "PB1";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

GPIO2.$name                              = "GPIO_BUTTON";
GPIO2.associatedPins[0].$name            = "PIN_S2";
GPIO2.associatedPins[0].assignedPort     = "PORTB";
GPIO2.associatedPins[0].assignedPin      = "21";
GPIO2.associatedPins[0].direction        = "INPUT";
GPIO2.associatedPins[0].internalResistor = "PULL_UP";

GPIO3.$name                         = "GPIO_LED";
GPIO3.associatedPins.create(3);
GPIO3.associatedPins[0].$name       = "PIN_RED";
GPIO3.associatedPins[0].pin.$assign = "PB26";
GPIO3.associatedPins[1].$name       = "PIN_GREEN";
GPIO3.associatedPins[1].pin.$assign = "PB27";
GPIO3.associatedPins[2].$name       = "PIN_BOARD";
GPIO3.associatedPins[2].pin.$assign = "PB22";

GPIO4.$name                              = "GPIO_GRAY";
GPIO4.associatedPins.create(2);
GPIO4.associatedPins[0].$name            = "PIN_GRAY_CLK";
GPIO4.associatedPins[0].pin.$assign      = "PA12";
GPIO4.associatedPins[1].$name            = "PIN_GRAY_DAT";
GPIO4.associatedPins[1].direction        = "INPUT";
GPIO4.associatedPins[1].internalResistor = "PULL_UP";
GPIO4.associatedPins[1].pin.$assign      = "PA13";

GPIO5.$name                         = "GPIO_HALL";
GPIO5.associatedPins.create(4);
GPIO5.associatedPins[0].$name       = "PIN_HALL_L_A";
GPIO5.associatedPins[0].direction   = "INPUT";
GPIO5.associatedPins[0].polarity    = "RISE";
GPIO5.associatedPins[0].interruptEn = true;
GPIO5.associatedPins[0].pin.$assign = "PB12";
GPIO5.associatedPins[1].$name       = "PIN_HALL_L_B";
GPIO5.associatedPins[1].direction   = "INPUT";
GPIO5.associatedPins[1].pin.$assign = "PB3";
GPIO5.associatedPins[2].$name       = "PIN_HALL_R_A";
GPIO5.associatedPins[2].direction   = "INPUT";
GPIO5.associatedPins[2].polarity    = "RISE";
GPIO5.associatedPins[2].interruptEn = true;
GPIO5.associatedPins[2].pin.$assign = "PB19";
GPIO5.associatedPins[3].$name       = "PIN_HALL_R_B";
GPIO5.associatedPins[3].direction   = "INPUT";
GPIO5.associatedPins[3].polarity    = "RISE";
GPIO5.associatedPins[3].pin.$assign = "PB2";

GPIO6.$name                          = "GPIO_SEG";
GPIO6.associatedPins.create(2);
GPIO6.associatedPins[0].$name        = "PIN_SEG_CLK";
GPIO6.associatedPins[0].initialValue = "SET";
GPIO6.associatedPins[0].pin.$assign  = "PB20";
GPIO6.associatedPins[1].$name        = "PIN_SEG_DIO";
GPIO6.associatedPins[1].initialValue = "SET";
GPIO6.associatedPins[1].pin.$assign  = "PA28";

GPIO7.$name                         = "GPIO_MT6816";
GPIO7.associatedPins.create(4);
GPIO7.associatedPins[0].$name       = "PIN_ENC_A";
GPIO7.associatedPins[0].direction   = "INPUT";
GPIO7.associatedPins[0].polarity    = "RISE_FALL";
GPIO7.associatedPins[0].interruptEn = true;
GPIO7.associatedPins[0].pin.$assign = "PA31";
GPIO7.associatedPins[1].$name       = "PIN_ENC_B";
GPIO7.associatedPins[1].direction   = "INPUT";
GPIO7.associatedPins[1].polarity    = "RISE_FALL";
GPIO7.associatedPins[1].interruptEn = true;
GPIO7.associatedPins[1].pin.$assign = "PB6";
GPIO7.associatedPins[2].$name       = "PIN_ENC_PWM";
GPIO7.associatedPins[2].direction   = "INPUT";
GPIO7.associatedPins[2].polarity    = "RISE_FALL";
GPIO7.associatedPins[2].interruptEn = true;
GPIO7.associatedPins[2].pin.$assign = "PB7";
GPIO7.associatedPins[3].$name       = "PIN_ENC_Z";
GPIO7.associatedPins[3].direction   = "INPUT";
GPIO7.associatedPins[3].polarity    = "RISE";
GPIO7.associatedPins[3].interruptEn = true;
GPIO7.associatedPins[3].pin.$assign = "PB8";

GPIO8.$name                         = "GPIO_STEPPER";
GPIO8.associatedPins.create(2);
GPIO8.associatedPins[0].$name       = "PIN_DIR";
GPIO8.associatedPins[0].pin.$assign = "PA26";
GPIO8.associatedPins[1].$name       = "PIN_EN";
GPIO8.associatedPins[1].pin.$assign = "PA1";

PWM1.$name                              = "PWM_MOTOR";
PWM1.peripheral.ccp0Pin.$assign         = "PB4";
PWM1.peripheral.ccp1Pin.$assign         = "PB18";
PWM1.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC4";
PWM1.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC5";
PWM1.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";
PWM1.ccp0PinConfig.enableConfig         = true;
PWM1.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric7";
PWM1.ccp1PinConfig.enableConfig         = true;

PWM2.$name                              = "PWM_STEPPER";
PWM2.ccIndex                            = [0];
PWM2.timerStartTimer                    = true;
PWM2.timerCount                         = 64000;
PWM2.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC0";
PWM2.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM2.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM2.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM2.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM2.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
PWM2.peripheral.ccp0Pin.$assign         = "PA17";

SYSCTL.forceDefaultClkConfig = true;

UART1.$name                            = "UART_XDS110";
UART1.peripheral.rxPin.$assign         = "PA11";
UART1.peripheral.txPin.$assign         = "PA10";
UART1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric8";
UART1.txPinConfig.enableConfig         = true;
UART1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
UART1.rxPinConfig.enableConfig         = true;

UART2.$name                            = "UART_IMU";
UART2.targetBaudRate                   = 921600;
UART2.peripheral.$assign               = "UART3";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
UART2.txPinConfig.enableConfig         = true;
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";
UART2.rxPinConfig.enableConfig         = true;

UART3.$name                            = "UART_K230";
UART3.targetBaudRate                   = 115200;
UART3.peripheral.$assign               = "UART1";
UART3.peripheral.rxPin.$assign         = "PA9";
UART3.peripheral.txPin.$assign         = "PA8";
UART3.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";
UART3.txPinConfig.enableConfig         = true;
UART3.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric13";
UART3.rxPinConfig.enableConfig         = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO1.associatedPins[0].pin.$suggestSolution = "PB13";
Board.peripheral.$suggestSolution            = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution   = "PA20";
Board.peripheral.swdioPin.$suggestSolution   = "PA19";
GPIO2.associatedPins[0].pin.$suggestSolution = "PB21";
PWM1.peripheral.$suggestSolution             = "TIMA1";
PWM2.peripheral.$suggestSolution             = "TIMG7";
SYSCTL.peripheral.$suggestSolution           = "SYSCTL";
UART1.peripheral.$suggestSolution            = "UART0";
UART2.peripheral.rxPin.$suggestSolution      = "PA25";
UART2.peripheral.txPin.$suggestSolution      = "PA14";
